# IsTransactionBeingCommitted Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailuresAccessor..::..IsTransactionBeingCommitted Method
FailuresAccessor Class See Also
---
Checks if the transaction for which failures are processed is being committed or rolled back.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsTransactionBeingCommitted()
```

Visual Basic
---
```text
Public Function IsTransactionBeingCommitted As Boolean
```

Visual C++
---
```text
public:
bool IsTransactionBeingCommitted()
```

# ### Return Value
True if current transaction is being committed, false if the transaction is being rolled back.
# Remarks
A transaction is considered as "being committed" if a caller has requested the transaction to be committed and no previous failure processing operation requested the transaction to be rolled back.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

# See Also
FailuresAccessor Class
Autodesk.Revit.DB Namespace